❌ **Elevated infrastructure apply failed.**

Triggered by @RomanKaliupinMelonusa via `/dagent apply-elevated`
The pipeline state has been updated to trigger an infrastructure recovery cycle.

> 💻 **Action Required:** Please pull the latest state and resume the pipeline locally. The `@infra-architect` agent will wake up to diagnose and fix the Terraform code:
> ```bash
> git pull origin feature/user-profile
> npm run agent:run -- --app apps/sample-app user-profile
> ```

<details><summary>Terraform output</summary>

```
Acquiring state lock. This may take a few moments...
random_uuid.oauth2_scope_id: Refreshing state... [id=f7c1b85b-be08-4d93-4ac9-0389b0b5d7e6]
random_uuid.demo_token[0]: Refreshing state... [id=16fc3942-557c-ae3d-8f87-d761619d3509]
data.azurerm_client_config.current: Reading...
azurerm_resource_group.main: Refreshing state... [id=/subscriptions/77bd5893-0a63-449a-b3cf-e1ad7dcadaee/resourceGroups/rg-sample-app-dev]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lNmY3MTM0OS05NzhmLTRlNGYtOTZhMS04OWMxNzc0YzM3NTY7b2JqZWN0SWQ9NjY3MmVhMDctMTY4YS00ZTcwLWI4NjItMGQxMzg0OWRjNmE0O3N1YnNjcmlwdGlvbklkPTc3YmQ1ODkzLTBhNjMtNDQ5YS1iM2NmLWUxYWQ3ZGNhZGFlZTt0ZW5hbnRJZD1hMTYxNWRhNS1jYWY4LTRhNGYtOTUwYS1jYTVmMDk4NzZkZTM=]
azuread_application.elevated_cicd: Refreshing state... [id=/applications/a52403b5-0d17-4df5-a4b4-e9306d4b4d44]
azuread_application_federated_identity_credential.github_env_secops_elevated: Refreshing state... [id=a52403b5-0d17-4df5-a4b4-e9306d4b4d44/federatedIdentityCredential/dc9b0ab9-4486-47a8-9c14-3910b63ee1d6]
azuread_service_principal.elevated_cicd: Refreshing state... [id=/servicePrincipals/6672ea07-168a-4e70-b862-0d13849dc6a4]
azurerm_service_plan.main: Refreshing state... [id=/subscriptions/77bd5893-0a63-449a-b3cf-e1ad7dcadaee/resourceGroups/rg-sample-app-dev/providers/Microsoft.Web/serverFarms/asp-sample-app-001]
azurerm_static_web_app.main: Refreshing state... [id=/subscriptions/77bd5893-0a63-449a-b3cf-e1ad7dcadaee/resourceGroups/rg-sample-app-dev/providers/Microsoft.Web/staticSites/swa-sample-app-001]
azurerm_log_analytics_workspace.main: Refreshing state... [id=/subscriptions/77bd5893-0a63-449a-b3cf-e1ad7dcadaee/resourceGroups/rg-sample-app-dev/providers/Microsoft.OperationalInsights/workspaces/log-sample-app-001]
azurerm_key_vault.main: Refreshing state... [id=/subscriptions/77bd5893-0a63-449a-b3cf-e1ad7dcadaee/resourceGroups/rg-sample-app-dev/providers/Microsoft.KeyVault/vaults/kv-sampleapp-001]
azurerm_storage_account.func_runtime: Refreshing state... [id=/subscriptions/77bd5893-0a63-449a-b3cf-e1ad7dcadaee/resourceGroups/rg-sample-app-dev/providers/Microsoft.Storage/storageAccounts/stsampleapp001]
azurerm_api_management.main: Refreshing state... [id=/subscriptions/77bd5893-0a63-449a-b3cf-e1ad7dcadaee/resourceGroups/rg-sample-app-dev/providers/Microsoft.ApiManagement/service/apim-sample-app-001]
azurerm_role_assignment.elevated_cicd_contributor: Refreshing state... [id=/subscriptions/77bd5893-0a63-449a-b3cf-e1ad7dcadaee/resourceGroups/rg-sample-app-dev/providers/Microsoft.Authorization/roleAssignments/c27529f6-06f1-ec15-4fe8-f0de44b0fccd]
azurerm_role_assignment.elevated_cicd_uaa: Refreshing state... [id=/subscriptions/77bd5893-0a63-449a-b3cf-e1ad7dcadaee/resourceGroups/rg-sample-app-dev/providers/Microsoft.Authorization/roleAssignments/ed87eded-f817-0b54-1423-979c0fca3469]
azuread_application.cicd: Refreshing state... [id=/applications/093f05fa-2eaa-44ed-b4c0-7a6fcd87ab56]
azuread_application.main: Refreshing state... [id=/applications/c5aee73f-dc3c-4f04-910c-8677dcccad90]
azurerm_application_insights.main: Refreshing state... [id=/subscriptions/77bd5893-0a63-449a-b3cf-e1ad7dcadaee/resourceGroups/rg-sample-app-dev/providers/Microsoft.Insights/components/appi-sample-app-001]
azuread_service_principal.main: Refreshing state... [id=/servicePrincipals/66ff35be-1bbf-4bde-b6a8-15683e2c49b0]
azuread_application_federated_identity_credential.github_env_development: Refreshing state... [id=093f05fa-2eaa-44ed-b4c0-7a6fcd87ab56/federatedIdentityCredential/518f0da1-01c7-4069-8ac7-5b03a6c5791e]
azuread_service_principal.cicd: Refreshing state... [id=/servicePrincipals/52223405-c36c-4568-b899-75ec813bb2ee]
azuread_application_federated_identity_credential.github_main: Refreshing state... [id=093f05fa-2eaa-44ed-b4c0-7a6fcd87ab56/federatedIdentityCredential/09d903f3-2eb5-4fe5-9ce7-d6c0f1751fe9]
azurerm_role_assignment.cicd_contributor: Refreshing state... [id=/subscriptions/77bd5893-0a63-449a-b3cf-e1ad7dcadaee/resourceGroups/rg-sample-app-dev/providers/Microsoft.Authorization/roleAssignments/4e1fa1e0-e9bd-9d1f-4fcf-3a398c940bf4]
azurerm_api_management_logger.appinsights: Refreshing state... [id=/subscriptions/77bd5893-0a63-449a-b3cf-e1ad7dcadaee/resourceGroups/rg-sample-app-dev/providers/Microsoft.ApiManagement/service/apim-sample-app-001/loggers/apim-logger-appinsights]
azurerm_api_management_diagnostic.appinsights: Refreshing state... [id=/subscriptions/77bd5893-0a63-449a-b3cf-e1ad7dcadaee/resourceGroups/rg-sample-app-dev/providers/Microsoft.ApiManagement/service/apim-sample-app-001/diagnostics/applicationinsights]
azurerm_storage_container.func_deployments: Refreshing state... [id=/subscriptions/77bd5893-0a63-449a-b3cf-e1ad7dcadaee/resourceGroups/rg-sample-app-dev/providers/Microsoft.Storage/storageAccounts/stsampleapp001/blobServices/default/containers/app-package]
azurerm_function_app_flex_consumption.main: Refreshing state... [id=/subscriptions/77bd5893-0a63-449a-b3cf-e1ad7dcadaee/resourceGroups/rg-sample-app-dev/providers/Microsoft.Web/sites/func-sample-app-001]
azurerm_role_assignment.kv_secrets_officer: Refreshing state... [id=/subscriptions/77bd5893-0a63-449a-b3cf-e1ad7dcadaee/resourceGroups/rg-sample-app-dev/providers/Microsoft.KeyVault/vaults/kv-sampleapp-001/providers/Microsoft.Authorization/roleAssignments/4c509914-250d-0930-8535-4edb2423414f]
azurerm_role_assignment.apim_kv_secrets_user: Refreshing state... [id=/subscriptions/77bd5893-0a63-449a-b3cf-e1ad7dcadaee/resourceGroups/rg-sample-app-dev/providers/Microsoft.KeyVault/vaults/kv-sampleapp-001/providers/Microsoft.Authorization/roleAssignments/213ba07f-7419-593c-7c8a-5b282b52a4cf]
azurerm_role_assignment.cicd_kv_secrets_user: Refreshing state... [id=/subscriptions/77bd5893-0a63-449a-b3cf-e1ad7dcadaee/resourceGroups/rg-sample-app-dev/providers/Microsoft.KeyVault/vaults/kv-sampleapp-001/providers/Microsoft.Authorization/roleAssignments/a4747d85-5e1d-ae89-c088-b1b55a51bc10]
azurerm_key_vault_secret.demo_token[0]: Refreshing state... [id=https://kv-sampleapp-001.vault.azure.net/secrets/demo-token/f49de01e2b6c4b4eaf5582f4251e64e5]
azurerm_api_management_named_value.demo_token[0]: Refreshing state... [id=/subscriptions/77bd5893-0a63-449a-b3cf-e1ad7dcadaee/resourceGroups/rg-sample-app-dev/providers/Microsoft.ApiManagement/service/apim-sample-app-001/namedValues/demo-token]
azurerm_role_assignment.func_kv_secrets_user: Refreshing state... [id=/subscriptions/77bd5893-0a63-449a-b3cf-e1ad7dcadaee/resourceGroups/rg-sample-app-dev/providers/Microsoft.KeyVault/vaults/kv-sampleapp-001/providers/Microsoft.Authorization/roleAssignments/d9a5846c-5f8b-dbaf-0310-867f33ea0c39]
azurerm_api_management_api.demo_auth[0]: Refreshing state... [id=/subscriptions/77bd5893-0a63-449a-b3cf-e1ad7dcadaee/resourceGroups/rg-sample-app-dev/providers/Microsoft.ApiManagement/service/apim-sample-app-001/apis/api-demo-auth;rev=1]
azurerm_key_vault_secret.func_host_key: Refreshing state... [id=https://kv-sampleapp-001.vault.azure.net/secrets/func-host-key/7829dce7a5594d37b224d4b0ba463d8c]
azurerm_api_management_named_value.func_host_key: Refreshing state... [id=/subscriptions/77bd5893-0a63-449a-b3cf-e1ad7dcadaee/resourceGroups/rg-sample-app-dev/providers/Microsoft.ApiManagement/service/apim-sample-app-001/namedValues/func-host-key]
azurerm_api_management_backend.func: Refreshing state... [id=/subscriptions/77bd5893-0a63-449a-b3cf-e1ad7dcadaee/resourceGroups/rg-sample-app-dev/providers/Microsoft.ApiManagement/service/apim-sample-app-001/backends/sample-app-func-backend]
azurerm_api_management_api.sample: Refreshing state... [id=/subscriptions/77bd5893-0a63-449a-b3cf-e1ad7dcadaee/resourceGroups/rg-sample-app-dev/providers/Microsoft.ApiManagement/service/apim-sample-app-001/apis/api-sample;rev=1]
azurerm_api_management_api_policy.demo_auth[0]: Refreshing state... [id=/subscriptions/77bd5893-0a63-449a-b3cf-e1ad7dcadaee/resourceGroups/rg-sample-app-dev/providers/Microsoft.ApiManagement/service/apim-sample-app-001/apis/api-demo-auth]
azurerm_api_management_api_policy.sample: Refreshing state... [id=/subscriptions/77bd5893-0a63-449a-b3cf-e1ad7dcadaee/resourceGroups/rg-sample-app-dev/providers/Microsoft.ApiManagement/service/apim-sample-app-001/apis/api-sample]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.azurerm_function_app_host_keys.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_function_app_host_keys" "main" {
      + blobs_extension_key             = (sensitive value)
      + default_function_key            = (sensitive value)
      + durabletask_extension_key       = (sensitive value)
      + event_grid_extension_config_key = (sensitive value)
      + event_grid_extension_key        = (sensitive value)
      + id                              = (known after apply)
      + name                            = "func-sample-app-001"
      + primary_key                     = (sensitive value)
      + resource_group_name             = "rg-sample-app-dev"
      + signalr_extension_key           = (sensitive value)
      + webpubsub_extension_key         = (sensitive value)
    }

  # azuread_application.cicd will be updated in-place
  ~ resource "azuread_application" "cicd" {
        id                             = "/applications/093f05fa-2eaa-44ed-b4c0-7a6fcd87ab56"
      ~ owners                         = [
          - "abdf7037-e903-4573-b81e-4b9521a3105b",
            # (1 unchanged element hidden)
        ]
        tags                           = [
            "cicd",
            "dev",
            "managed-by-terraform",
            "sample-app",
        ]
        # (24 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # azuread_application.elevated_cicd will be updated in-place
  ~ resource "azuread_application" "elevated_cicd" {
        id                             = "/applications/a52403b5-0d17-4df5-a4b4-e9306d4b4d44"
      ~ owners                         = [
          - "abdf7037-e903-4573-b81e-4b9521a3105b",
            # (1 unchanged element hidden)
        ]
        tags                           = [
            "dev",
            "elevated-cicd",
            "managed-by-terraform",
            "sample-app",
        ]
        # (24 unchanged attributes hidden)

      - required_resource_access {
          - resource_app_id = "00000003-0000-0000-c000-000000000000" -> null

          - resource_access {
              - id   = "1bfefb4e-e0b5-418b-a88f-73c46d2cc8e9" -> null
              - type = "Role" -> null
            }
          - resource_access {
              - id   = "1bfefb4e-e0b5-418b-a88f-73c46d2cc8e9" -> null
              - type = "Role" -> null
            }
        }
      + required_resource_access {
          + resource_app_id = "00000003-0000-0000-c000-000000000000"

          + resource_access {
              + id   = "1bfefb4e-e0b5-418b-a88f-73c46d2cc8e9"
              + type = "Role"
            }
        }

        # (6 unchanged blocks hidden)
    }

  # azuread_application.main will be updated in-place
  ~ resource "azuread_application" "main" {
        id                             = "/applications/c5aee73f-dc3c-4f04-910c-8677dcccad90"
      ~ owners                         = [
          - "abdf7037-e903-4573-b81e-4b9521a3105b",
            # (1 unchanged element hidden)
        ]
        tags                           = [
            "dev",
            "managed-by-terraform",
            "sample-app",
        ]
        # (24 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # azuread_service_principal.cicd will be updated in-place
  ~ resource "azuread_service_principal" "cicd" {
        id                            = "/servicePrincipals/52223405-c36c-4568-b899-75ec813bb2ee"
      ~ owners                        = [
          - "abdf7037-e903-4573-b81e-4b9521a3105b",
          + "6672ea07-168a-4e70-b862-0d13849dc6a4",
        ]
        tags                          = [
            "cicd",
            "dev",
            "managed-by-terraform",
            "sample-app",
        ]
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azuread_service_principal.elevated_cicd will be updated in-place
  ~ resource "azuread_service_principal" "elevated_cicd" {
        id                            = "/servicePrincipals/6672ea07-168a-4e70-b862-0d13849dc6a4"
      ~ owners                        = [
          - "abdf7037-e903-4573-b81e-4b9521a3105b",
          + "6672ea07-168a-4e70-b862-0d13849dc6a4",
        ]
        tags                          = [
            "dev",
            "elevated-cicd",
            "managed-by-terraform",
            "sample-app",
        ]
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azuread_service_principal.main will be updated in-place
  ~ resource "azuread_service_principal" "main" {
        id                            = "/servicePrincipals/66ff35be-1bbf-4bde-b6a8-15683e2c49b0"
      ~ owners                        = [
          - "abdf7037-e903-4573-b81e-4b9521a3105b",
          + "6672ea07-168a-4e70-b862-0d13849dc6a4",
        ]
        tags                          = [
            "dev",
            "managed-by-terraform",
            "sample-app",
        ]
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_api_management_api.sample will be updated in-place
  ~ resource "azurerm_api_management_api" "sample" {
        id                    = "/subscriptions/77bd5893-0a63-449a-b3cf-e1ad7dcadaee/resourceGroups/rg-sample-app-dev/providers/Microsoft.ApiManagement/service/apim-sample-app-001/apis/api-sample;rev=1"
        name                  = "api-sample"
        # (17 unchanged attributes hidden)

      ~ import {
          ~ content_value  = <<-EOT
                # =============================================================================
                # Sample API — OpenAPI 3.0.3
                # =============================================================================
                # Protected endpoint demonstrating dual-mode auth (demo + Entra ID).
                # APIM applies check-header or validate-jwt based on auth_mode.
                # =============================================================================
                openapi: "3.0.3"
                info:
                  title: Sample API
                  version: "1.0.0"
                  description: Sample protected API endpoint.
                paths:
                  /hello:
                    get:
                      operationId: hello
                      summary: Get a greeting
                      description: Returns a greeting message. Protected by APIM auth policy.
                      parameters:
                        - name: name
                          in: query
                          required: false
                          schema:
                            type: string
                            default: World
                      responses:
                        "200":
                          description: Successful response
                          content:
                            application/json:
                              schema:
                                type: object
                                properties:
                                  message:
                                    type: string
                                  timestamp:
                                    type: string
                                    format: date-time
                        "401":
                          description: Unauthorized — missing or invalid auth token
              +   /profile:
              +     get:
              +       operationId: getProfile
              +       summary: Get the authenticated user's profile
              +       description: Returns the profile for the authenticated user including display name, email, and theme preference.
              +       responses:
              +         "200":
              +           description: Successful response
              +           content:
              +             application/json:
              +               schema:
              +                 type: object
              +                 required:
              +                   - id
              +                   - displayName
              +                   - email
              +                   - theme
              +                 properties:
              +                   id:
              +                     type: string
              +                     format: uuid
              +                   displayName:
              +                     type: string
              +                   email:
              +                     type: string
              +                     format: email
              +                   theme:
              +                     type: string
              +                     enum:
              +                       - light
              +                       - dark
              +                       - system
              +         "401":
              +           description: Unauthorized — missing or invalid auth token
              +     patch:
              +       operationId: updateProfile
              +       summary: Update the authenticated user's profile
              +       description: Updates display name and/or theme preference for the authenticated user.
              +       requestBody:
              +         required: true
              +         content:
              +           application/json:
              +             schema:
              +               type: object
              +               required:
              +                 - displayName
              +                 - theme
              +               properties:
              +                 displayName:
              +                   type: string
              +                   minLength: 2
              +                   maxLength: 50
              +                 theme:
              +                   type: string
              +                   enum:
              +                     - light
              +                     - dark
              +                     - system
              +       responses:
              +         "200":
              +           description: Profile updated successfully
              +           content:
              +             application/json:
              +               schema:
              +                 type: object
              +                 required:
              +                   - id
              +                   - displayName
              +                   - email
              +                   - theme
              +                 properties:
              +                   id:
              +                     type: string
              +                     format: uuid
              +                   displayName:
              +                     type: string
              +                   email:
              +                     type: string
              +                     format: email
              +                   theme:
              +                     type: string
              +                     enum:
              +                       - light
              +                       - dark
              +                       - system
              +         "400":
              +           description: Invalid request body
              +           content:
              +             application/json:
              +               schema:
              +                 type: object
              +                 properties:
              +                   error:
              +                     type: string
              +                   message:
              +                     type: string
              +         "401":
              +           description: Unauthorized — missing or invalid auth token
            EOT
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_function_app_flex_consumption.main will be updated in-place
  ~ resource "azurerm_function_app_flex_consumption" "main" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING" = (sensitive value)
            # (4 unchanged elements hidden)
        }
        id                                             = "/subscriptions/77bd5893-0a63-449a-b3cf-e1ad7dcadaee/resourceGroups/rg-sample-app-dev/providers/Microsoft.Web/sites/func-sample-app-001"
        name                                           = "func-sample-app-001"
        tags                                           = {
            "environment" = "dev"
            "managed_by"  = "terraform"
            "project"     = "sample-app"
        }
        # (31 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (27 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # azurerm_key_vault_secret.func_host_key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "func_host_key" {
        id                      = "https://kv-sampleapp-001.vault.azure.net/secrets/func-host-key/7829dce7a5594d37b224d4b0ba463d8c"
        name                    = "func-host-key"
        tags                    = {
            "environment" = "dev"
            "managed_by"  = "terraform"
            "project"     = "sample-app"
        }
      ~ value                   = (sensitive value)
        # (9 unchanged attributes hidden)
    }

  # azurerm_role_assignment.elevated_cicd_kv_secrets_officer will be created
  + resource "azurerm_role_assignment" "elevated_cicd_kv_secrets_officer" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "6672ea07-168a-4e70-b862-0d13849dc6a4"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets Officer"
      + scope                            = "/subscriptions/77bd5893-0a63-449a-b3cf-e1ad7dcadaee/resourceGroups/rg-sample-app-dev/providers/Microsoft.KeyVault/vaults/kv-sampleapp-001"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.kv_secrets_officer must be replaced
-/+ resource "azurerm_role_assignment" "kv_secrets_officer" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/77bd5893-0a63-449a-b3cf-e1ad7dcadaee/resourceGroups/rg-sample-app-dev/providers/Microsoft.KeyVault/vaults/kv-sampleapp-001/providers/Microsoft.Authorization/roleAssignments/4c509914-250d-0930-8535-4edb2423414f" -> (known after apply)
      ~ name                                   = "4c509914-250d-0930-8535-4edb2423414f" -> (known after apply)
      ~ principal_id                           = "abdf7037-e903-4573-b81e-4b9521a3105b" -> "6672ea07-168a-4e70-b862-0d13849dc6a4" # forces replacement
      ~ principal_type                         = "User" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/77bd5893-0a63-449a-b3cf-e1ad7dcadaee/providers/Microsoft.Authorization/roleDefinitions/b86a8fe4-44ce-4948-aee5-eccb2c155cd7" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azurerm_static_web_app.main will be updated in-place
  ~ resource "azurerm_static_web_app" "main" {
        id                                 = "/subscriptions/77bd5893-0a63-449a-b3cf-e1ad7dcadaee/resourceGroups/rg-sample-app-dev/providers/Microsoft.Web/staticSites/swa-sample-app-001"
        name                               = "swa-sample-app-001"
      - repository_branch                  = "feature/user-profile" -> null
      - repository_url                     = "https://github.com/RomanKaliupinMelonusa/DAGent-t" -> null
        tags                               = {
            "environment" = "dev"
            "managed_by"  = "terraform"
            "project"     = "sample-app"
        }
        # (11 unchanged attributes hidden)
    }

Plan: 2 to add, 10 to change, 1 to destroy.
azurerm_role_assignment.kv_secrets_officer: Destroying... [id=/subscriptions/77bd5893-0a63-449a-b3cf-e1ad7dcadaee/resourceGroups/rg-sample-app-dev/providers/Microsoft.KeyVault/vaults/kv-sampleapp-001/providers/Microsoft.Authorization/roleAssignments/4c509914-250d-0930-8535-4edb2423414f]
azurerm_static_web_app.main: Modifying... [id=/subscriptions/77bd5893-0a63-449a-b3cf-e1ad7dcadaee/resourceGroups/rg-sample-app-dev/providers/Microsoft.Web/staticSites/swa-sample-app-001]
azuread_application.elevated_cicd: Modifying... [id=/applications/a52403b5-0d17-4df5-a4b4-e9306d4b4d44]
azurerm_function_app_flex_consumption.main: Modifying... [id=/subscriptions/77bd5893-0a63-449a-b3cf-e1ad7dcadaee/resourceGroups/rg-sample-app-dev/providers/Microsoft.Web/sites/func-sample-app-001]
azurerm_role_assignment.kv_secrets_officer: Destruction complete after 1s
azurerm_role_assignment.kv_secrets_officer: Creating...
azuread_application.elevated_cicd: Modifications complete after 2s [id=/applications/a52403b5-0d17-4df5-a4b4-e9306d4b4d44]
azuread_service_principal.elevated_cicd: Modifying... [id=/servicePrincipals/6672ea07-168a-4e70-b862-0d13849dc6a4]
azuread_service_principal.elevated_cicd: Modifications complete after 2s [id=/servicePrincipals/6672ea07-168a-4e70-b862-0d13849dc6a4]
azurerm_role_assignment.elevated_cicd_kv_secrets_officer: Creating...
azuread_application.cicd: Modifying... [id=/applications/093f05fa-2eaa-44ed-b4c0-7a6fcd87ab56]
azuread_application.main: Modifying... [id=/applications/c5aee73f-dc3c-4f04-910c-8677dcccad90]
azuread_application.cicd: Modifications complete after 2s [id=/applications/093f05fa-2eaa-44ed-b4c0-7a6fcd87ab56]
azuread_service_principal.cicd: Modifying... [id=/servicePrincipals/52223405-c36c-4568-b899-75ec813bb2ee]
azuread_application.main: Modifications complete after 2s [id=/applications/c5aee73f-dc3c-4f04-910c-8677dcccad90]
azuread_service_principal.main: Modifying... [id=/servicePrincipals/66ff35be-1bbf-4bde-b6a8-15683e2c49b0]
azuread_service_principal.cicd: Modifications complete after 2s [id=/servicePrincipals/52223405-c36c-4568-b899-75ec813bb2ee]
azuread_service_principal.main: Modifications complete after 2s [id=/servicePrincipals/66ff35be-1bbf-4bde-b6a8-15683e2c49b0]
azurerm_static_web_app.main: Still modifying... [id=/subscriptions/77bd5893-0a63-449a-b3cf-...oft.Web/staticSites/swa-sample-app-001, 10s elapsed]
azurerm_function_app_flex_consumption.main: Still modifying... [id=/subscriptions/77bd5893-0a63-449a-b3cf-...icrosoft.Web/sites/func-sample-app-001, 10s elapsed]
azurerm_static_web_app.main: Modifications complete after 16s [id=/subscriptions/77bd5893-0a63-449a-b3cf-e1ad7dcadaee/resourceGroups/rg-sample-app-dev/providers/Microsoft.Web/staticSites/swa-sample-app-001]
azurerm_function_app_flex_consumption.main: Still modifying... [id=/subscriptions/77bd5893-0a63-449a-b3cf-...icrosoft.Web/sites/func-sample-app-001, 20s elapsed]
azurerm_function_app_flex_consumption.main: Modifications complete after 29s [id=/subscriptions/77bd5893-0a63-449a-b3cf-e1ad7dcadaee/resourceGroups/rg-sample-app-dev/providers/Microsoft.Web/sites/func-sample-app-001]
data.azurerm_function_app_host_keys.main: Reading...
azurerm_api_management_api.sample: Modifying... [id=/subscriptions/77bd5893-0a63-449a-b3cf-e1ad7dcadaee/resourceGroups/rg-sample-app-dev/providers/Microsoft.ApiManagement/service/apim-sample-app-001/apis/api-sample;rev=1]
data.azurerm_function_app_host_keys.main: Read complete after 1s [id=/subscriptions/77bd5893-0a63-449a-b3cf-e1ad7dcadaee/resourceGroups/rg-sample-app-dev/providers/Microsoft.Web/sites/func-sample-app-001]
azurerm_api_management_api.sample: Modifications complete after 8s [id=/subscriptions/77bd5893-0a63-449a-b3cf-e1ad7dcadaee/resourceGroups/rg-sample-app-dev/providers/Microsoft.ApiManagement/service/apim-sample-app-001/apis/api-sample;rev=1]

Error: unexpected status 409 (409 Conflict) with error: RoleAssignmentExists: The role assignment already exists. The ID of the existing role assignment is e9f87b65f26d4546a7447bf3f4df77a9.

  with azurerm_role_assignment.elevated_cicd_kv_secrets_officer,
  on cicd.tf line 124, in resource "azurerm_role_assignment" "elevated_cicd_kv_secrets_officer":
 124: resource "azurerm_role_assignment" "elevated_cicd_kv_secrets_officer" {


Error: unexpected status 409 (409 Conflict) with error: RoleAssignmentExists: The role assignment already exists. The ID of the existing role assignment is e9f87b65f26d4546a7447bf3f4df77a9.

  with azurerm_role_assignment.kv_secrets_officer,
  on main.tf line 90, in resource "azurerm_role_assignment" "kv_secrets_officer":
  90: resource "azurerm_role_assignment" "kv_secrets_officer" {

::error::Terraform exited with code 1.
```

</details>